Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если НЕ ЗначениеЗаполнено(Заказ) И НЕ ЗначениеЗаполнено(Отправка) Тогда
		Сообщить("Укажите заказ и/или отправку для привязки вложения.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ТипДокумента) Тогда
		Сообщить("Не заполнен тип документа вложения.");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

Процедура ПриПроведении(Отказ, РежимПроведения)
	ЛогикаЗаказов.ЗарегистрироватьВложениеДокумента(ЭтотОбъект);
КонецПроцедуры
