Функция ПолучитьЗапросРеестраЗаказов() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК Заказ,
	|	Заказ.Дата КАК Дата,
	|	Заказ.Номер КАК Номер,
	|	Заказ.Заказчик КАК Заказчик,
	|	Заказ.Менеджер КАК Менеджер,
	|	Заказ.СтатусЗаказа КАК СтатусЗаказа,
	|	Заказ.СтатусОплатыПоСчету КАК СтатусОплаты,
	|	Заказ.СуммаЗаказаРуб КАК СуммаЗаказаРуб,
	|	Заказ.СуммаМаржиРуб КАК СуммаМаржиРуб
	|ИЗ
	|	Документ.Заказ КАК Заказ";
КонецФункции

Функция ПолучитьЗапросКонтроляОплат() Экспорт
	Возврат
	"ВЫБРАТЬ
	|	Заказ.Ссылка КАК Заказ,
	|	Заказ.Номер КАК НомерЗаказа,
	|	Заказ.Заказчик КАК Заказчик,
	|	Заказ.СуммаЗаказаРуб КАК ПланОплаты,
	|	ЕСТЬNULL(Оплаты.Оплачено, 0) КАК Оплачено,
	|	ВЫБОР
	|		КОГДА Заказ.СуммаЗаказаРуб - ЕСТЬNULL(Оплаты.Оплачено, 0) < 0 ТОГДА 0
	|		ИНАЧЕ Заказ.СуммаЗаказаРуб - ЕСТЬNULL(Оплаты.Оплачено, 0)
	|	КОНЕЦ КАК Остаток
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|		ЛЕВОЕ СОЕДИНЕНИЕ (
	|			ВЫБРАТЬ
	|				Финансы.Заказ КАК Заказ,
	|				СУММА(Финансы.СуммаРуб) КАК Оплачено
	|			ИЗ
	|				РегистрСведений.ФинансыЗаказов КАК Финансы
	|			ГДЕ
	|				Финансы.ВидОплаты = &ВидОплатыЗаказчика
	|			СГРУППИРОВАТЬ ПО
	|				Финансы.Заказ
	|		) КАК Оплаты
	|		ПО Заказ.Ссылка = Оплаты.Заказ";
КонецФункции
