Процедура Сформировать() Экспорт
	ПолучитьДанные();
КонецПроцедуры

Функция ПолучитьДанные() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Отправка.Ссылка КАК Отправка,
	|	Отправка.Дата КАК Дата,
	|	Отправка.Номер КАК Номер,
	|	Отправка.Перевозчик КАК Перевозчик,
	|	Отправка.МаршрутДоставки КАК Маршрут,
	|	Отправка.ТрекНомер КАК ТрекНомер,
	|	Отправка.ПланДатаОтправки КАК ПланДатаОтправки,
	|	Отправка.ФактДатаОтправки КАК ФактДатаОтправки,
	|	Отправка.ПланДатаПрибытия КАК ПланДатаПрибытия,
	|	Отправка.ФактДатаПрибытия КАК ФактДатаПрибытия,
	|	Отправка.ПланСтоимостьДоставки КАК ПланСтоимостьДоставки,
	|	Отправка.СтоимостьПеревозкиРуб КАК ФактСтоимостьРуб,
	|	Отправка.СтатусДоставки КАК СтатусДоставки
	|ИЗ
	|	Документ.Отправка КАК Отправка";
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции
